Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectDiff
Object difference base class.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectDiff.#ctor(Tekla.Structures.Identifier,Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectDiffEnum)
Initializes a new instance of the Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectDiff class.
id: The object identifier.
type: The object difference type.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectDiff.Id
Gets or sets the object identifier.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectDiff.Type
Gets the difference type.